Tekla.Structures.CatalogInternal.dotcatProfileNames_t
Serialization structure for Profile Item Enumerator

Tekla.Structures.CatalogInternal.dotcatProfileNames_t.TotalItemsForExport
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatProfileNames_t.CurrentIndex
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatProfileNames_t.TotalItemsInCurrentBatch
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatProfileNames_t.ClientId
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.dotcatProfileNames_t.aProfileItemNames
Profile names list.